qmckl_sherman_morrison_woodbury.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-06 Thu 20:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sherman-Morrison-Woodbury</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX CoE" />
<link rel="stylesheet" title="Standard" href="qmckl.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Sherman-Morrison-Woodbury</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgadd43b4">1. Headers</a></li>
<li><a href="#orgec33f70">2. Naïve Sherman-Morrison</a>
<ul>
<li><a href="#org8391bbf">2.1. <code>qmckl_sherman_morrison</code></a>
<ul>
<li><a href="#org0a85db2">2.1.1. Requirements</a></li>
<li><a href="#org1f17e6b">2.1.2. C header</a></li>
<li><a href="#orgebbf38a">2.1.3. C source</a></li>
<li><a href="#org23ed72f">2.1.4. Performance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2e1b231">3. Woodbury 2x2</a>
<ul>
<li><a href="#orgea51b7f">3.1. <code>qmckl_woodbury_2</code></a>
<ul>
<li><a href="#org6cbc806">3.1.1. Requirements</a></li>
<li><a href="#org73f7310">3.1.2. C header</a></li>
<li><a href="#org69077b9">3.1.3. C source</a></li>
<li><a href="#org40bb6b8">3.1.4. Performance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgce42610">4. Woodbury 3x3</a>
<ul>
<li><a href="#org75bea2d">4.1. <code>qmckl_woodbury_3</code></a>
<ul>
<li><a href="#orgad727b9">4.1.1. Requirements</a></li>
<li><a href="#org4aa86e6">4.1.2. C header</a></li>
<li><a href="#org90cb10c">4.1.3. C source</a></li>
<li><a href="#org63af23f">4.1.4. Performance&#x2026;</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2d9decc">5. Sherman-Morrison with update splitting</a>
<ul>
<li><a href="#org49f1f3b">5.1. <code>qmckl_sherman_morrison_splitting</code></a>
<ul>
<li><a href="#orgbd927a8">5.1.1. Requirements</a></li>
<li><a href="#org863c809">5.1.2. C header</a></li>
<li><a href="#org4951eab">5.1.3. C source</a></li>
<li><a href="#org996f476">5.1.4. Performance&#x2026;</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7d59b76">6. Woodbury 3x3 and 2x2 with Sherman-Morrison and update splitting</a>
<ul>
<li><a href="#orgd0baeff">6.1. <code>qmckl_sherman_morrison_smw32s</code></a>
<ul>
<li><a href="#org8dadcae">6.1.1. Requirements</a></li>
<li><a href="#org64cdc82">6.1.2. C header</a></li>
<li><a href="#org4eb5d66">6.1.3. C source</a></li>
<li><a href="#org47cc9e2">6.1.4. Performance&#x2026;</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdd9ddc7">7. Helper Functions</a>
<ul>
<li><a href="#orgae1bfa9">7.1. <code>qmckl_slagel_splitting</code></a>
<ul>
<li><a href="#orgd81be5a">7.1.1. Requirements</a></li>
<li><a href="#orgedeb3c7">7.1.2. C header</a></li>
<li><a href="#org8559485">7.1.3. C source</a></li>
<li><a href="#orgf3d3d1c">7.1.4. Performance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org61b5fe8">8. End of files</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgadd43b4" class="outline-2">
<h2 id="orgadd43b4"><span class="section-number-2">1</span> Headers</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"qmckl.h"</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"assert.h"</span>
<span style="color: #483d8b;">#ifdef</span> HAVE_CONFIG_H
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"config.h"</span>
<span style="color: #483d8b;">#endif</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;math.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
  <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>;
  context = qmckl_context_create();
  <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">rc</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec33f70" class="outline-2">
<h2 id="orgec33f70"><span class="section-number-2">2</span> Naïve Sherman-Morrison</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8391bbf" class="outline-3">
<h3 id="org8391bbf"><span class="section-number-3">2.1</span> <code>qmckl_sherman_morrison</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is the simplest of the available Sherman-Morrison-Woodbury kernels. It applies rank-1 updates one by one in
the order that is given. It only checks if the denominator in the Sherman-Morrison formula is not too close to
zero when an update is evaluated. It will exit with an error code of the denominator is too close to zero.
</p>

<p>
The formula for any update \(u_j\) (index \(j\) is suppresed for clarity) that is applied is
\[
    (S + uv^T)^{-1} = S^{-1} - \frac{S^{-1} uv^T S^{-1}}{1 + v^T S^{-1} u}
   \]
</p>

<p>
where
\(S\) is the Slater-matrix,
\(u\) and \(v^T\) are the column and row vectors containing the updates,
\(S^{-1}\) is the inverse of the Slater-matrix.
</p>

<p>
Even though the Slater-matrix \(S\) with all updates applied at once is invertable, during the course of applying
updates to the inverse Slater-matrix \(S^{-1}\) one-by-one it can happen that one of the intermediate inverse
matrices \(S^{-1}\) becomes singular. Therefore a global threshold value \(\epsilon\) is defined that is used to
evaluate each individual update \(u_j\) when it is applied.
</p>

<p>
This value sets the lower bound for which the
denominator \(1+v_j^TS^{-1}u_j\) is considered to be too small and will most probably result in a singular matrix
\(S\), or at least in an inverse of \(S\) of very poor numerical quality. Therefore, when \(1+v_j^TS^{-1}u_j \geq \epsilon\),
the update is applied as usual and the kernel exits with return code \texttt{QMCKL_SUCCESS}.
If \(1+v_j^TS^{-1}u_j \leq \epsilon\) the update is rejected and the kernel exits with return code \texttt{QMCKL_FAILURE}.
</p>

<p>
If the determinant of the Slater-matrix is passed, it will be updated to the determinant resulting
from applying the updates to the original matrix.
</p>

<table id="org3525fa1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">qmckl<sub>context</sub></td>
<td class="org-left">context</td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">LDS</td>
<td class="org-left">in</td>
<td class="org-left">Leading dimension of Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">Dim</td>
<td class="org-left">in</td>
<td class="org-left">Dimension of Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">N<sub>updates</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of rank-1 updates to be applied to Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">Updates[N<sub>updates</sub>*Dim]</td>
<td class="org-left">in</td>
<td class="org-left">Array containing the updates</td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">Updates<sub>index</sub>[N<sub>updates</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Array containing the rank-1 updates</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">breakdown</td>
<td class="org-left">in</td>
<td class="org-left">Break-down parameter on which to fail or not</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">Slater<sub>inv</sub>[LDS*Dim]</td>
<td class="org-left">inout</td>
<td class="org-left">Array containing the inverse of a Slater-matrix</td>
</tr>

<tr>
<td class="org-left">double*</td>
<td class="org-left">determinant</td>
<td class="org-left">inout</td>
<td class="org-left">Determinant of the Slater-matrix</td>
</tr>
</tbody>
</table>
</div>
