qmckl_sherman_morrison_woodbury.html

<div id="outline-container-org6cbc806" class="outline-4">
<h4 id="org6cbc806"><span class="section-number-4">3.1.1</span> Requirements</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li><code>context</code> is not <code>qmckl_null_context</code></li>
<li><code>LDS &gt;= 2</code></li>
<li><code>Dim &gt;= 2</code></li>
<li><code>Updates</code> is allocated with \(2 \times Dim\) elements</li>
<li><code>Updates_index</code> is allocated with \(2\) elements</li>
<li><code>breakdown</code> is a small number such that \(0 < breakdown << 1\)</li>
<li><code>Slater_inv</code> is allocated with \(Dim \times Dim\) elements</li>
</ul>
</div>
</div>

<div id="outline-container-org73f7310" class="outline-4">
<h4 id="org73f7310"><span class="section-number-4">3.1.2</span> C header</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_woodbury_2</span> (
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">context</span> <span style="color: #a0522d;">qmckl_context</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">LDS</span> <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Dim</span> <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Updates</span>* <span style="color: #228b22;">double</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Updates_index</span>* <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">breakdown</span> <span style="color: #228b22;">double</span>,
      <span style="color: #228b22;">Slater_inv</span>* <span style="color: #228b22;">double</span>,
      <span style="color: #228b22;">determinant</span>* <span style="color: #228b22;">double</span>* ); 
</pre>
</div>
</div>
</div>

<div id="outline-container-org69077b9" class="outline-4">
<h4 id="org69077b9"><span class="section-number-4">3.1.3</span> C source</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;math.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"qmckl.h"</span>

<span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_woodbury_2</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">LDS</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">Dim</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">Updates</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">Updates_index</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">breakdown</span>,
                                <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">Slater_inv</span>,
                                <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">determinant</span>) {
/*
<span style="color: #b22222;">    C := S^{-1} * U,    dim x 2</span>
<span style="color: #b22222;">    B := 1 + V * C,     2 x 2</span>
<span style="color: #b22222;">    D := V * S^{-1},    2 x dim</span>
*/

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;
  }

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">row1</span> = (Updates_index[0] - 1);
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">row2</span> = (Updates_index[1] - 1);

  // <span style="color: #b22222;">Compute C = S_inv * U  !! NON-STANDARD MATRIX MULTIPLICATION BECAUSE</span>
  // <span style="color: #b22222;">OF LAYOUT OF 'Updates' !!</span>
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">C</span>[2 * Dim];
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; Dim; i++) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; 2; j++) {
      C[i * 2 + j] = 0;
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">k</span> = 0; k &lt; Dim; k++) {
        C[i * 2 + j] += Slater_inv[i * LDS + k] * Updates[Dim * j + k];
      }
    }
  }

  // <span style="color: #b22222;">Compute B = 1 + V * C</span>
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B0</span> = C[row1 * 2] + 1;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B1</span> = C[row1 * 2 + 1];
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B2</span> = C[row2 * 2];
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B3</span> = C[row2 * 2 + 1] + 1;

  // <span style="color: #b22222;">Check if determinant of inverted matrix is not zero</span>
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">det</span> = B0 * B3 - B1 * B2;
  <span style="color: #a020f0;">if</span> (fabs(det) &lt; breakdown) {
    <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  // <span style="color: #b22222;">Update det(S) when passed</span>
  <span style="color: #a020f0;">if</span> (determinant != <span style="color: #008b8b;">NULL</span>)
    *determinant *= det;

  // <span style="color: #b22222;">Compute B^{-1} with explicit formula for 2x2 inversion</span>
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">Binv</span>[4], <span style="color: #a0522d;">idet</span> = 1.0 / det;
  Binv[0] = idet * B3;
  Binv[1] = -1.0 * idet * B1;
  Binv[2] = -1.0 * idet * B2;
  Binv[3] = idet * B0;

  // <span style="color: #b22222;">Compute tmp = B^{-1} x (V.S^{-1})</span>
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">tmp</span>[2 * Dim];
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; 2; i++) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; Dim; j++) {
      tmp[i * Dim + j] = Binv[i * 2] * Slater_inv[row1 * LDS + j];
      tmp[i * Dim + j] += Binv[i * 2 + 1] * Slater_inv[row2 * LDS + j];
    }
  }

  // <span style="color: #b22222;">Compute (S + U V)^{-1} = S^{-1} - C x tmp</span>
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; Dim; i++) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; Dim; j++) {
      Slater_inv[i * LDS + j] -= C[i * 2] * tmp[j];
      Slater_inv[i * LDS + j] -= C[i * 2 + 1] * tmp[Dim + j];
    }
  }

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>
</div>
</div>
