qmckl_sherman_morrison_woodbury.html

<div id="outline-container-org4aa86e6" class="outline-4">
<h4 id="org4aa86e6"><span class="section-number-4">4.1.2</span> C header</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_woodbury_3</span> (
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">context</span> <span style="color: #a0522d;">qmckl_context</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">LDS</span> <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Dim</span> <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Updates</span>* <span style="color: #228b22;">double</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Updates_index</span>* <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">breakdown</span> <span style="color: #228b22;">double</span>,
      <span style="color: #228b22;">Slater_inv</span>* <span style="color: #228b22;">double</span>,
      <span style="color: #228b22;">determinant</span>* <span style="color: #228b22;">double</span>* ); 
</pre>
</div>
</div>
</div>

<div id="outline-container-org90cb10c" class="outline-4">
<h4 id="org90cb10c"><span class="section-number-4">4.1.3</span> C source</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;math.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"qmckl.h"</span>

<span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_woodbury_3</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">LDS</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">Dim</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">Updates</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span>* <span style="color: #a0522d;">Updates_index</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">breakdown</span>,
                                <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">Slater_inv</span>,
                                <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">determinant</span>) {
/*
<span style="color: #b22222;">    C := S^{-1} * U,    dim x 3</span>
<span style="color: #b22222;">    B := 1 + V * C,     3 x 3</span>
<span style="color: #b22222;">    D := V * S^{-1},    3 x dim</span>
*/

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;
  }

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">row1</span> = (Updates_index[0] - 1);
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">row2</span> = (Updates_index[1] - 1);
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">row3</span> = (Updates_index[2] - 1);

  // <span style="color: #b22222;">Compute C = S_inv * U  !! NON-STANDARD MATRIX MULTIPLICATION BECAUSE</span>
  // <span style="color: #b22222;">OF LAYOUT OF 'Updates' !!</span>
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">C</span>[3 * Dim];
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; Dim; i++) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; 3; j++) {
      C[i * 3 + j] = 0;
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">k</span> = 0; k &lt; Dim; k++) {
        C[i * 3 + j] += Slater_inv[i * LDS + k] * Updates[Dim * j + k];
      }
    }
  }

  // <span style="color: #b22222;">Compute B = 1 + V.C</span>
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B0</span> = C[row1 * 3] + 1;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B1</span> = C[row1 * 3 + 1];
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B2</span> = C[row1 * 3 + 2];
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B3</span> = C[row2 * 3];
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B4</span> = C[row2 * 3 + 1] + 1;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B5</span> = C[row2 * 3 + 2];
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B6</span> = C[row3 * 3];
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B7</span> = C[row3 * 3 + 1];
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">B8</span> = C[row3 * 3 + 2] + 1;

  // <span style="color: #b22222;">Check if determinant of B is not too close to zero</span>
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">det</span>;
  det = B0 * (B4 * B8 - B5 * B7) - B1 * (B3 * B8 - B5 * B6) +
        B2 * (B3 * B7 - B4 * B6);
  <span style="color: #a020f0;">if</span> (fabs(det) &lt; breakdown) {
    <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  // <span style="color: #b22222;">Update det(Slater) if passed</span>
  <span style="color: #a020f0;">if</span> (determinant != <span style="color: #008b8b;">NULL</span>)
    *determinant *= det;

  // <span style="color: #b22222;">Compute B^{-1} with explicit formula for 3x3 inversion</span>
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">Binv</span>[9], <span style="color: #a0522d;">idet</span> = 1.0 / det;
  Binv[0] = (B4 * B8 - B7 * B5) * idet;
  Binv[1] = -(B1 * B8 - B7 * B2) * idet;
  Binv[2] = (B1 * B5 - B4 * B2) * idet;
  Binv[3] = -(B3 * B8 - B6 * B5) * idet;
  Binv[4] = (B0 * B8 - B6 * B2) * idet;
  Binv[5] = -(B0 * B5 - B3 * B2) * idet;
  Binv[6] = (B3 * B7 - B6 * B4) * idet;
  Binv[7] = -(B0 * B7 - B6 * B1) * idet;
  Binv[8] = (B0 * B4 - B3 * B1) * idet;

  // <span style="color: #b22222;">Compute tmp = B^{-1} x (V.S^{-1})</span>
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">tmp</span>[3 * Dim];
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; 3; i++) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; Dim; j++) {
      tmp[i * Dim + j] = Binv[i * 3] * Slater_inv[row1 * LDS + j];
      tmp[i * Dim + j] += Binv[i * 3 + 1] * Slater_inv[row2 * LDS + j];
      tmp[i * Dim + j] += Binv[i * 3 + 2] * Slater_inv[row3 * LDS + j];
    }
  }

  // <span style="color: #b22222;">Compute (S + U V)^{-1} = S^{-1} - C x tmp</span>
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; Dim; i++) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; Dim; j++) {
      Slater_inv[i * LDS + j] -= C[i * 3] * tmp[j];
      Slater_inv[i * LDS + j] -= C[i * 3 + 1] * tmp[Dim + j];
      Slater_inv[i * LDS + j] -= C[i * 3 + 2] * tmp[2 * Dim + j];
    }
  }

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>
</div>
</div>
