qmckl_sherman_morrison_woodbury.html

<div id="outline-container-org7d59b76" class="outline-2">
<h2 id="org7d59b76"><span class="section-number-2">6</span> Woodbury 3x3 and 2x2 with Sherman-Morrison and update splitting</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd0baeff" class="outline-3">
<h3 id="orgd0baeff"><span class="section-number-3">6.1</span> <code>qmckl_sherman_morrison_smw32s</code></h3>
<div class="outline-text-3" id="text-6-1">
<p>
The Woodbury 3x3 and 2x2 kernel with Sherman-Morrison and update splitting combines the low-level Woodbury 3x3 kernel,
the Woobury 2x2 kernel and Sherman-Morrison with update splitting. It works the almost the same as Woodbury 3x3 with
Sherman-Morrison and update splitting, except that when there is a remainder of two rank-1 updates, it is first tried
with Woodbury 2x2 instead of sending them all to Sherman-Morrison with update splitting. For example, in the case of
5 updates the updates are applied in 1 block of 3 updates end 1 block of 2 updates.
</p>

<p>
If the determinant of the Slater-matrix is passed, it will be updated to the determinant resulting
from applying the updates to the original matrix.
</p>

<table id="org11806ef" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">qmckl<sub>context</sub></td>
<td class="org-left">context</td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">LDS</td>
<td class="org-left">in</td>
<td class="org-left">Leading dimension of Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">Dim</td>
<td class="org-left">in</td>
<td class="org-left">Dimension of Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">N<sub>updates</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of rank-1 updates to be applied to Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">Updates[N<sub>updates</sub>*Dim]</td>
<td class="org-left">in</td>
<td class="org-left">Array containing the updates</td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">Updates<sub>index</sub>[N<sub>updates</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Array containing the rank-1 updates</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">breakdown</td>
<td class="org-left">in</td>
<td class="org-left">Break-down parameter on which to fail or not</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">Slater<sub>inv</sub>[LDS*Dim]</td>
<td class="org-left">inout</td>
<td class="org-left">Array containing the inverse of a Slater-matrix</td>
</tr>

<tr>
<td class="org-left">double*</td>
<td class="org-left">determinant</td>
<td class="org-left">inout</td>
<td class="org-left">Determinant of the Slater-matrix</td>
</tr>
</tbody>
</table>
</div>
