qmckl_sherman_morrison_woodbury.html

<div id="outline-container-orgae1bfa9" class="outline-3">
<h3 id="orgae1bfa9"><span class="section-number-3">7.1</span> <code>qmckl_slagel_splitting</code></h3>
<div class="outline-text-3" id="text-7-1">
<p>
<code>qmckl_slagel_splitting</code> is the non-recursive, inner part of the 'Sherman-Morrison with update splitting'-kernel.
It is used internally to apply a collection of \(N\) rank-1 updates to the inverse Slater-matrix \(S^{-1}\) and
splitting an update in two equal pieces if necessary. In case of a split, it applies the first half of the update,
while putting the second half in a waiting queue to be applied at the end.
</p>

<p>
Therefore, when \(1+v_j^TS^{-1}u_j \geq \epsilon\), the update is applied as usual. Otherwise, \(u_j\) will be redefined
as \(\frac{1}{2}u_j\). One half is applied immediately, the other half will be applied at the end of the algorithm, using vectors
\(u_{j'}=\frac{1}{2}u_j\) and \(v_{j'}^T=v_{j}^T\), which are stored in the array \texttt{later_updates}.
</p>

<p>
If the determinant of the Slater-matrix is passed, it will be updated to the determinant resulting
from applying the updates to the original matrix.
</p>

<table id="orgaa5dba4" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">LDS</td>
<td class="org-left">in</td>
<td class="org-left">Leading dimension of Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">Dim</td>
<td class="org-left">in</td>
<td class="org-left">Dimension of Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">N<sub>updates</sub></td>
<td class="org-left">in</td>
<td class="org-left">Number of rank-1 updates to be applied to Slater<sub>inv</sub></td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">Updates[N<sub>updates</sub>*Dim]</td>
<td class="org-left">in</td>
<td class="org-left">Array containing the rank-1 updates</td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">Updates<sub>index</sub>[N<sub>updates</sub>]</td>
<td class="org-left">in</td>
<td class="org-left">Array containing positions of the rank-1 updates</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">breakdown</td>
<td class="org-left">in</td>
<td class="org-left">Break-down parameter on which to fail or not</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">Slater<sub>inv</sub>[LDS*Dim]</td>
<td class="org-left">inout</td>
<td class="org-left">Array containing the inverse Slater-matrix</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">later<sub>updates</sub>[Dim * N<sub>updates</sub>]</td>
<td class="org-left">inout</td>
<td class="org-left">Array containing the split updates for later</td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">later<sub>index</sub>[N<sub>updates</sub>]</td>
<td class="org-left">inout</td>
<td class="org-left">Array containing the positions of the split updates for later</td>
</tr>

<tr>
<td class="org-left">uint64<sub>t</sub></td>
<td class="org-left">later</td>
<td class="org-left">inout</td>
<td class="org-left">Number of split updates for later</td>
</tr>

<tr>
<td class="org-left">double*</td>
<td class="org-left">determinant</td>
<td class="org-left">inout</td>
<td class="org-left">Determinant of the Slater-matrix</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-orgd81be5a" class="outline-4">
<h4 id="orgd81be5a"><span class="section-number-4">7.1.1</span> Requirements</h4>
<div class="outline-text-4" id="text-7-1-1">
<ul class="org-ul">
<li><code>LDS &gt;= 2</code></li>
<li><code>Dim &gt;= 2</code></li>
<li><code>N_updates &gt;= 1</code></li>
<li><code>Updates</code> is allocated with \(N_updates \times Dim\) elements</li>
<li><code>Updates_index</code> is allocated with \(N_updates\) elements</li>
<li><code>breakdown</code> is a small number such that \(0 < breakdown << 1\)</li>
<li><code>Slater_inv</code> is allocated with \(Dim \times Dim\) elements</li>
<li><code>later_updates</code> is allocated with \(later \times Dim\) elements</li>
<li><code>later_index</code> is allocated with \(N_updates\) elements</li>
<li><code>later &gt;= 0</code></li>
</ul>
</div>
</div>
