qmckl_sherman_morrison_woodbury.html

<div id="outline-container-orgedeb3c7" class="outline-4">
<h4 id="orgedeb3c7"><span class="section-number-4">7.1.2</span> C header</h4>
<div class="outline-text-4" id="text-7-1-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">double</span> <span style="color: #0000ff;">qmckl_slagel_splitting</span> (
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">LDS</span> <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Dim</span> <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">N_updates</span> <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Updates</span>* <span style="color: #228b22;">double</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">Updates_index</span>* <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">breakdown</span> <span style="color: #228b22;">double</span>,
      <span style="color: #228b22;">Slater_inv</span>* <span style="color: #228b22;">double</span>,
      <span style="color: #228b22;">later_updates</span>* <span style="color: #228b22;">double</span>,
      <span style="color: #228b22;">later_index</span>* <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #228b22;">later</span>* <span style="color: #a0522d;">uint64_t</span>,
      <span style="color: #228b22;">determinant</span>* <span style="color: #228b22;">double</span>* ); 
</pre>
</div>
</div>
</div>

<div id="outline-container-org8559485" class="outline-4">
<h4 id="org8559485"><span class="section-number-4">7.1.3</span> C source</h4>
<div class="outline-text-4" id="text-7-1-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;math.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"qmckl.h"</span>

<span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_slagel_splitting</span>(<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">LDS</span>,
                                              <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">Dim</span>,
                                              <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">N_updates</span>,
                                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> *<span style="color: #a0522d;">Updates</span>,
                                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">uint64_t</span> *<span style="color: #a0522d;">Updates_index</span>,
                                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">breakdown</span>,
                                              <span style="color: #228b22;">double</span> *<span style="color: #a0522d;">Slater_inv</span>,
                                              <span style="color: #228b22;">double</span> *<span style="color: #a0522d;">later_updates</span>,
                                              <span style="color: #228b22;">uint64_t</span> *<span style="color: #a0522d;">later_index</span>,
                                              <span style="color: #228b22;">uint64_t</span> *<span style="color: #a0522d;">later</span>,
                                              <span style="color: #228b22;">double</span> *<span style="color: #a0522d;">determinant</span>) {
// <span style="color: #b22222;">#ifdef DEBUG //  Leave commented out since debugging information is not yet implemented in QMCkl.</span>
//   <span style="color: #b22222;">std::cerr &lt;&lt; "Called slagel_splitting with " &lt;&lt; N_updates &lt;&lt; " updates" &lt;&lt; std::endl;</span>
// <span style="color: #b22222;">#endif</span>

  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">C</span>[Dim];
  <span style="color: #228b22;">double</span> <span style="color: #a0522d;">D</span>[Dim];

  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">l</span> = 0;
  // <span style="color: #b22222;">For each update</span>
  <span style="color: #a020f0;">while</span> (l &lt; N_updates) {
    // <span style="color: #b22222;">C = S^{-1} x U_l</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; Dim; i++) {
      C[i] = 0;
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; Dim; j++) {
        C[i] += Slater_inv[i * LDS + j] * Updates[l * Dim + j];
      }
    }

    // <span style="color: #b22222;">Denominator</span>
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">den</span> = 1 + C[Updates_index[l] - 1];
    <span style="color: #a020f0;">if</span> (fabs(den) &lt; breakdown) { // <span style="color: #b22222;">Here is decided to split the update, or not.</span>

      // <span style="color: #b22222;">U_l = U_l / 2: split the update in 2 equal halves and save the second halve in later_updates</span>
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; Dim; i++) {
        later_updates[*later * Dim + i] = Updates[l * Dim + i] / 2.0;
        C[i] /= 2.0;
      }
      later_index[*later] = Updates_index[l];
      (*later)++;

      den = 1 + C[Updates_index[l] - 1];
    } // <span style="color: #b22222;">From here onwards we continue with applying the first havel of the update to Slater_inv</span>
    <span style="color: #228b22;">double</span> <span style="color: #a0522d;">iden</span> = 1 / den;

    <span style="color: #a020f0;">if</span> (determinant != <span style="color: #008b8b;">NULL</span>)
      *determinant *= den;

    // <span style="color: #b22222;">D = v^T x S^{-1}</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; Dim; j++) {
      D[j] = Slater_inv[(Updates_index[l] - 1) * LDS + j];
    }

    // <span style="color: #b22222;">S^{-1} = S^{-1} - C x D / den</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span> = 0; i &lt; Dim; i++) {
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">j</span> = 0; j &lt; Dim; j++) {
        <span style="color: #228b22;">double</span> <span style="color: #a0522d;">update</span> = C[i] * D[j] * iden;
        Slater_inv[i * LDS + j] -= update;
      }
    }
    l += 1;
  }

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3d3d1c" class="outline-4">
<h4 id="orgf3d3d1c"><span class="section-number-4">7.1.4</span> Performance</h4>
<div class="outline-text-4" id="text-7-1-4">
<p>
This function cannot be used by itself and is used in Sherman-Morrison with update splitting and Woodbury 3x3 and 2x2
with Sherman-Morrison and update splitting. Please look at the performance reccomendations for those two kernels.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org61b5fe8" class="outline-2">
<h2 id="org61b5fe8"><span class="section-number-2">8</span> End of files</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #0000ff;">assert</span> (<span style="color: #228b22;">qmckl_context_destroy</span>(<span style="color: #a0522d;">context</span>) == QMCKL_SUCCESS);
  <span style="color: #a020f0;">return</span> 0;

}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX CoE</p>
<p class="date">Created: 2022-10-06 Thu 20:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
